Repository: mohamedatef04/style_hub
Catalog: lib/l10n/intl_*.arb
Languages: ar

# splashLogo
source: Style Hub
ar: ستايل هاب

# onBoardingTitle1
source: Shop Online
ar: تسوق على الإنترنت

# onBoardingSubtitle1
source: Discover the latest fashion trends and find the perfect outfit for any occasion.
ar: تكشف الأحداث الأخيرة وإيجاد الملابس المثالية لكل مكان.

# onBoardingTitle2
source: Find Your Style Match
ar: عثر على نطاقك المثالي

# onBoardingSubtitle2
source: Get personalized fashion recommendations based on your preferences and style.
ar: احصل على إقتراحات مثالية للملابس حسب إختياراتك ونظامك.

source: Next
ar: التالي

source: Get Started
ar: ابدأ

# loginWelcomeMessage
source: Welcome to Style Hub! Please log in to continue.
ar: مرحبا بك في ستايل هاب! يرجى تسجيل الدخول للمتابعة.

# firstNameHint
source: Enter your first name
ar: أدخل اسمك الأول

# lastNameHint
source: Enter your last name
ar: أدخل اسمك الأخير

source: Email
ar: البريد الإلكتروني

# emailHint
source: Enter your email address
ar: أدخل عنوان البريد الإلكتروني الخاص بك

source: Password
ar: كلمة المرور

# passwordHint
source: Enter your password
ar: أدخل كلمة المرور الخاصة بك

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

# guest
source: Guest Account
ar: حساب مهمل

# dontHaveAccount
source: Don't have an account?
ar: لا يوجد لديك حساب؟

source: Or continue with
ar: أو استمر في

source: Sign in with Google
ar: سجل باستخدام جوجل

# registerWelcomeMessage
source: Welcome to Style Hub! Please register to start shopping.
ar: مرحبا بك في ستايل هاب! يرجى التسجيل للمتابعة.

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الأخير

source: Sign Up
ar: انشئء حساب

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# verifyEmail
source: Verify Your Email
ar: تحقق من البريد الإلكتروني

# emailVerified
source: Email Verified Successfully
ar: تم التحقق من بريدك الإلكتروني بنجاح

source: Send OTP
ar: إرسال OTP

# otpValidation
source: Please enter your OTP code.
ar: يرجى إدخال رمز OTP الخاص بك.

source: Enter OTP Code
ar: أدخل رمز OTP

# enterOtpMessage
source: Enter the OTP code sent to your email to verify your account.
ar: أدخل الرمز OTP المرسل إلى بريدك الإلكتروني للتحقق من حسابك.

# newOtpSent
source: A new OTP has been sent to your email
ar: تم إرسال رمز OTP جديد إلى بريدك الإلكتروني

# didntReceiveCode
source: Didn't receive the code?
ar: لم تستلم الرمز؟

source: Resend Code
ar: إعادة إرسال الرمز

source: Submit
ar: تأكيد

# enterNewPassword
source: Enter Your New Password
ar: أدخل كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

# confirmPasswordvValidation
source: Enter your confirm password
ar: يرجى إدخال تأكيد كلمة المرور

source: Password does not match
ar: كلمة المرور غير متطابقة

# enterConfirmPassword
source: Enter Your Confirm Password
ar: أدخل تأكيد كلمة المرور

source: Reset
ar: إعادة تعيين

source: Reset Password
ar: إعادة تعيين كلمة المرور

# passwordUpdated
source: Password Updated Successfully
ar: تم تحديث كلمة المرور بنجاح

# passwordUpdatedMessage
source: Your password has been updated successfully. You can now log in with your new password.
ar: تم تحديث كلمة المرور الخاصة بك بنجاح. يمكنك الآن تسجيل الدخول مع كلمة المرور الجديدة.

source: Back to Login
ar: العودة إلى تسجيل الدخول

# firstNameValidation
source: Please enter your first name.
ar: يرجى إدخال اسمك الأول.

# lastNameValidation
source: Please enter your last name.
ar: يرجى إدخال اسمك الأخير.

# emailValidation1
source: Please enter your email address.
ar: يرجى إدخال عنوان بريد إلكتروني.

# emailValidation2
source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صالح.

# passwordValidation1
source: Please enter your password
ar: يرجى إدخال كلمة المرور الخاصة بك

# passwordValidation2
source: Password must be â‰¥8 chars include upperlower, number & special char
ar: كلمة المرور يجب أن تكون 8 حروف على الأقل وتتضمن حرف كبير وحرف صغير ورقم وحرف خاص.

source: Error
ar: خطأ

source: Success
ar: نجاح

source: Check Your Email
ar: تحقق من بريدك الإلكتروني

# homeNavBar
source: Home
ar: الرئيسية

# appLanguage
source: Language
ar: اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

# categoryNavBar
source: Categories
ar: الاقسام

# homeWelcomeMessage
source: Welcome, to Style Hub APP!
ar: اهلا بك في تطبيق ستايل هاب!

source: Search
ar: بحث

# searchHint
source: Search for products
ar: ابحث عن منتجات

source: New Collection
ar: مجموعة جديدة

source: See All
ar: عرض الكل

source: Item Details
ar: تفاصيل المنتج

source: Add to Cart
ar: أضف إلى السلة

source: Quantity
ar: الكمية

source: Description
ar: وصف المنتج

source: Details View
ar: عرض التفاصيل

source: Color
ar: اللون

source: Stock
ar: المتاح

source: Cart
ar: السلة

source: My Cart
ar: سلة مشترياتي

source: Coupon
ar: كوبون

# couponHint
source: Enter your coupon code
ar: ادخل كوبونك الخاص

# couponValidation
source: Please enter your coupon code
ar: يرجى إدخال كوبونك الخاص

# couponApplied
source: Coupon applied successfully
ar: تم تطبيق الكوبون بنجاح

source: Apply
ar: تطبيق

source: Total
ar: المجموع

source: Discount
ar: خصم

source: Final Total
ar: المجموع النهائي

source: Items
ar: عناصر

# checkout
source: Proceed to Checkout
ar: طرق الدفع

# checkoutBar
source: Checkout
ar: الدفع

# addedToCartSuccess
source: Item added to cart successfully
ar: تم إضافة المنتج إلى السلة بنجاح

# itemRemovedFromCart
source: Item removed from cart successfully
ar: تم حذف المنتج من السلة بنجاح

source: DELIVERY METHOD
ar: طرق التوصيل

# addEditAddress
source: ADD/EDIT
ar: إضافة/تعديل

source: Edit
ar: تعديل

# delete
source: Remove
ar: حذف

source: Add New Address
ar: إضافة عنوان جديد

# editAddress
source: Edit Your Address
ar: تعديل عنواني

source: My Addresses
ar: عناويني

# addressAdded
source: Address added successfully
ar: تم إضافة العنوان بنجاح

# emptyAddress
source: You have no saved addresses
ar: لا يوجد عناوين

source: PAYMENT METHOD
ar: طرق الدفع

source: State
ar: الولاية

# stateHint
source: Enter your state
ar: أدخل الولاية

# stateValidation1
source: Please enter your state
ar: يرجى إدخال الولاية

# stateValidation2
source: Please enter a valid state
ar: يرجى إدخال ولاية صالحة

source: City
ar: المدينة

# cityHint
source: Enter your city
ar: أدخل المدينة

# cityValidation1
source: Please enter your city
ar: يرجى إدخال المدينة

# cityValidation2
source: Please enter a valid city
ar: يرجى إدخال مدينة صالحة

source: Steet
ar: الشارع

# steetHint
source: Enter your steet
ar: أدخل الشارع

# steetValidation1
source: Please enter your steet
ar: يرجى إدخال الشارع

source: Apartment
ar: الشقة

# apartmentHint
source: Enter your apartment
ar: أدخل الشقة

# apartmentValidation1
source: Please enter your apartment
ar: يرجى إدخال الشقة

# apartmentValidation2
source: Please enter a valid apartment
ar: يرجى إدخال شقة صالحة

source: Phone Number
ar: رقم الهاتف

# phoneNumberHint
source: Enter your phone number
ar: أدخل رقم الهاتف

# phoneNumberValidation1
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف

# phoneNumberValidation2
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

source: Notes
ar: ملاحظات

# notesHint
source: Enter your notes
ar: أدخل الملاحظات

source: Save
ar: حفظ

source: Orders
ar: الطلبات

# searchView
source: Search
ar: بحث

source: Logout
ar: تسجيل الخروج
